Tekla.Structures.Plugins.CustomPartInputTypeAttribute
The CustomPartInputTypeAttribute class is used for defining the input type.
Based on the type the system will then ask for the correct number of input points in the creation.
The attribute is initialized from the custom attribute
[CustomPartInputType(CustomPartBase.CustomPartInputType.INPUT_1_POINT)]
in the custom part source code.

Tekla.Structures.Plugins.CustomPartInputTypeAttribute.#ctor(Tekla.Structures.Plugins.CustomPartBase.CustomPartInputType)
The custom attribute uses this to store the input type to the system.
This is not to be used by itself.
Type: The custom input type.

Tekla.Structures.Plugins.CustomPartInputTypeAttribute.Type
The custom attribute uses this to store the input type to the system.
This is not to be used by itself.

Tekla.Structures.Plugins.CustomPartInputTypeAttribute.#ctor(System.Int32)
The custom attribute uses this to store the input type to the system.
This is not to be used by itself.
Type: The custom part input type.